nxvpro/Resources/soap_set_ptz_preset.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <_FUNC_ xmlns="http://www.onvif.org/ver20/ptz/wsdl">
            <ProfileToken>_PROFILE_TOKEN_</ProfileToken>
            <PresetName>_PRESET_TOKEN_</PresetName>
        </_FUNC_>
    </s:Body>
</s:Envelope>
